app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            @comments = Comment.where(user_id: params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]