app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "bobo"]]
SELECT "users".* FROM "users"
---
    def index

        if params.has_key?(:username)
            @user=User.where(username: params[:username])
            render json: @user
        else
            render json: User.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "\"steve\""], ["email", "SteveEmail"]]
---
    def create

        user = User.new(user_params)

        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "what"], ["id", 3]]
---
    def update
        user = User.find(params[:id])

        if user.update(user_params)